{
  "homepage": {
    "title": "LUCAS FERNANDO",
    "navTitle": "Home",
    "subtitle": "Front-end Developer",
    "button_content": "Let’s talk"
  },
  "about_me": {
    "title": "About me",
    "navTitle": "About Me",
    "paragraph_zero": "In my journey as a web developer and designer, my passion for programming and design is the fuel that drives my constant pursuit of excellence.",
    "paragraph_one": "Innovation is at the core of my work, always seeking new ways to enhance the intersection between programming and design.",
    "button_content": "Explore technologies"
  },
  "tech": {
    "title": "Technologies",
    "navTitle": "Technologies",
    "paragraph_zero": "In the quest to provide the best user experience, I strive in development, trying to incorporate both usability and aesthetics to deliver better and bolder experiences.",
    "paragraph_one": "I use HTML, CSS, Javascript, as well as other tools and frameworks to maximize usability and aesthetics when creating new interfaces.",
    "button_content": "Explore projects"
  },
  "projects": {
    "title": "Projects",
    "navTitle": "Projects",
    "paragraph_zero": "Here, I share some of the projects I've executed as a web developer, while seeking to improve my skills and absorb new technologies.",
    "paragraph_one": "Although I don't have previous professional experience, I am committed to gaining knowledge and contributing significantly to projects.",
    "button_content": "Contact me",
    "slider": {
      "project_message": "Learn more about this project at ",
      "button_close_content": "Close"
    }
  },
  "contact": {
    "title": "Let’s talk",
    "navTitle": "Contact",
    "paragraph_zero": "If you have a project in mind or are simply interested in learning more, get in touch, and let's move forward.",
    "email": "lucasfernando.dev@gmail.com"
  },
  "error404": {
    "title": "Oops! Page not found.",
    "paragraph_zero": "Unfortunately, the page you are looking for was not found. To continue exploring, return to the homepage.",
    "button_content": "Back to the homepage",
    "image_alt": "Illustration of an astronaut holding a dog, both fascinated while observing the launch of a rocket in the background."
  }
}
